{"id":933,"date":"2016-02-11T18:29:03","date_gmt":"2016-02-11T18:29:03","guid":{"rendered":"http:\/\/dev2.hpc.ucla.edu\/r\/dae-3\/r-data-analysis-examplespower-analysis-for-paired-sample-t-test\/"},"modified":"2017-01-05T12:51:56","modified_gmt":"2017-01-05T19:51:56","slug":"power-analysis-for-paired-sample-t-test","status":"publish","type":"page","link":"https:\/\/stats.oarc.ucla.edu\/r\/dae\/power-analysis-for-paired-sample-t-test\/","title":{"rendered":"&#13;\nPower Analysis for Paired Sample t-test |  R Data Analysis Examples"},"content":{"rendered":"<h2>Examples<\/h2>\n<p>Example 1. A company markets an eight week long weight loss program \nand claims that at the end of the program on average a participant will have\nlost 5 pounds. On the other hand, you have studied the program and you believe \nthat their program is scientifically unsound and shouldn&#8217;t work at all. With some \nlimited funding at hand, you want test the hypothesis that the weight loss \nprogram does not help people lose weight. Your plan is to get a random sample of \npeople and put them on the program. You will measure their weight at the \nbeginning of the program and then measure their weight again at the end of the \nprogram.&nbsp; Based on some previous research, you believe that the standard \ndeviation of the weight difference over eight weeks will be 5 pounds. \nYou now want to know how many people you should enroll in the program to test\nyour hypothesis.&nbsp;<\/p>\n<p>Example 2. A human factors researcher wants to study the difference between \ndominant hand and the non-dominant hand in terms of manual dexterity. She designs an \nexperiment where each subject would place 10 small beads on the table in a bowl, \nonce with the dominant hand and once with the non-dominant hand. She measured \nthe number seconds needed in each round to complete the task. She has also decided \nthat the order in which the two hands are measured should be counter balanced. She \nexpects that the average difference in time would be 5 seconds with the dominant \nhand being more efficient with standard deviation of 10. She collects her \ndata on a sample of 35 subjects. The question is, what is the statistical power of her \ndesign with an N of 35 to detect the difference in the magnitude of 5 seconds.&nbsp; <\/p>\n<h2>Prelude to the Power Analysis<\/h2>\n<p>In both of the examples, there are two measures on each subject, and we are \ninterested in the mean of the difference of the two measures. This can be done \nwith a t-test for paired samples (dependent samples). In a power analysis, there are always a pair of \nhypotheses:&nbsp; a specific null hypothesis and a specific alternative hypothesis. \nFor instance, in Example 1, the null hypothesis is that the mean weight loss \nis 5 pounds and the alternative is zero pounds. In Example 2, the null hypothesis \nis that mean difference is zero seconds and the alternative hypothesis is that the mean \ndifference is 5 seconds. <\/p>\n<p>There are two different aspects of power analysis. One is to calculate the necessary\nsample size for a specified power. The other aspect  is to calculate the power when\ngiven a specific sample size. Technically, power is the probability of rejecting \nthe null hypothesis when the specific alternative hypothesis is true.&nbsp;<\/p>\n<p>Both of these calculations depend on the Type I error rate, the significance \nlevel. The significance level (called alpha), or the Type I error rate, is the \nprobability of rejecting H<sub>0<\/sub> when it is actually true. The smaller the \nType I error rate, the larger the sample size required for the same power. \nLikewise, the smaller the Type I error rate, the smaller the power for the same \nsample size. This is the trade-off between the reliability and sensitivity of \nthe test.<\/p>\n<h2>Power Analysis<\/h2>\n<p>In R, it is fairly straightforward to perform a power analysis for \nthe paired sample t-test using R&#8217;s <b>pwr.t.test<\/b> function.<\/p>\n<p>For the calculation of Example 1, we can set the power at different \nlevels and calculate the sample size for each level. For example, we can \nset the power to be at the .80 level at first, and then reset it to be at the .85 level, and so on. \nFirst, we specify the two means, the mean for the \nnull hypothesis and the mean for the alternative hypothesis. Then we specify the \nstandard deviation for the difference in the means. The default significance level (alpha \nlevel) is set at .05, so we will not specify it for the initial runs.  \nLast, we tell R that we are performing a paired-sample t-test.<\/p>\n<blockquote>\n<pre><b>library(pwr)\r\n\r\npwr.t.test(d=(0-5)\/5,power=0.8,sig.level=0.05,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 9.93785\r\n              d = 1\r\n      sig.level = 0.05\r\n          power = 0.8\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs* \r\n\r\n<b>pwr.t.test(d=(0-5)\/5,power=0.85,sig.level=0.05,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 11.06276\r\n              d = 1\r\n      sig.level = 0.05\r\n          power = 0.85\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs* \r\n\r\n<b>pwr.t.test(d=(0-5)\/5,power=0.9,sig.level=0.05,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 12.58547\r\n              d = 1\r\n      sig.level = 0.05\r\n          power = 0.9\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs*<\/pre>\n<\/blockquote>\n<p>Next, let&#8217;s change the level of significance to .01 with a power of .85. What does this \nmean for our sample size calculation? <\/p>\n<blockquote>\n<pre><b>pwr.t.test(d=(0-5)\/5,power=0.85,sig.level=0.01,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 16.46151\r\n              d = 1\r\n      sig.level = 0.01\r\n          power = 0.85\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs*<\/pre>\n<\/blockquote>\n<p>As you can see, the sample size goes up from 11 to 17 for specified power of .85 \nwhen alpha drops from .05 to .01. <\/p>\n<p>This \nmeans if we want our test to be more reliable, i.e.,  not rejecting the null hypothesis in \ncase it is true, we will need a larger sample size. If we think that we want a \nlower alpha at 0.01 level and a high power at .90 then we would need 15 subjects \nas shown below. Remember this is under the normality assumption. If the \ndistribution is not normal, then 15 subjects are, in general, not enough for \nthis t-test.<\/p>\n<blockquote>\n<pre><b>pwr.t.test(d=(0-5)\/5,power=0.9,sig.level=0.01,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 18.30346\r\n              d = 1\r\n      sig.level = 0.01\r\n          power = 0.9\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs*<\/pre>\n<\/blockquote>\n<p>Now, let&#8217;s now turn our calculation around the other way. Let&#8217;s look at Example 2.\nIn this example, our researcher has already collected data on 35 \nsubjects. How much statistical power does her design have to detect the \ndifference of 5 seconds with standard deviation of 10 seconds?<\/p>\n<p>Again we use the \n<b>pwr.t.test<\/b> function to calculate the power. We enter the first mean \nas 0 and the second mean as 5 since the only thing we know is the difference of \nthe two means is 5 seconds. In terms of hypotheses, this is the same way of \nsaying that the \nnull hypothesis is that the difference is zero, and the alternative hypothesis is that \nthe mean difference is 5. Then we enter the standard deviation for the \ndifference and the number of subjects. Again we specify the <b>onesamp<\/b> option since the \ndesign is a paired-sample t-test.<\/p>\n<blockquote>\n<pre><b>pwr.t.test(d=(0-5)\/10,n=35,sig.level=0.01,type=\"paired\",alternative=\"two.sided\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 35\r\n              d = 0.5\r\n      sig.level = 0.01\r\n          power = 0.5939348\r\n    alternative = two.sided\r\n\r\n NOTE: n is number of *pairs*<\/pre>\n<\/blockquote>\n<p>This means that the researcher would detect the \ndifference of 5 seconds  about 59 percent of the time.&nbsp; Notice we did this \nas two-sided test. Since it is believed that our dominant hand is always better \nthan the non-dominant hand, the researcher actually could conduct a one-tailed \ntest. Now, let&#8217;s recalculate the power for one-tailed paired-sample t-test.<\/p>\n<blockquote>\n<pre><b>pwr.t.test(d=(0-5)\/10,n=35,sig.level=0.01,type=\"paired\",alternative=\"less\")<\/b>\r\n\r\n     Paired t test power calculation \r\n\r\n              n = 35\r\n              d = -0.5\r\n      sig.level = 0.01\r\n          power = 0.6961194\r\n    alternative = less\r\n\r\n NOTE: n is number of *pairs*<\/pre>\n<\/blockquote>\n<h2>Discussion<\/h2>\n<p>You have probably noticed that the way to conduct the power analysis for \npaired-sample t-test is the same as for the one-sample t-test.  This is due to\nthe fact that in the paired-sample t-test we compute the difference in the two\nscores for each subject and then compute the mean and standard deviation of the\ndifferences.  This turns the paired-sample t-test into a \none-sample t-test. <\/p>\n<p>The other technical assumption is the normality assumption. If the \ndistribution is skewed, then a small sample size may not have the power shown in \nthe results, because the value in the results is calculated using the method \nbased on the normality assumption. It \nmight not even be a good idea to do a t-test on a small sample to begin with. <\/p>\n<p>What we really need to know is the difference between the two means, not the \nindividual values. In fact, what really matters, is the difference of the means \nover the standard deviation. We call this the effect size. It is usually not an \neasy task to determine the effect size. It usually comes \nfrom studying the existing literature or from pilot studies. A good estimate of the effect size \nis the key to a successful power analysis.<\/p>\n<h2>See Also<\/h2>\n<ul>\n<li>Related R Commands\n<ul>\n<li><b>pwr<\/b> &#8212;  R package for power analysis.<\/li>\n<li><b>pwr.t.test<\/b> &#8212;  Sample size and power determination.<\/li>\n<\/ul>\n<\/li>\n<li>References<\/li>\n<ul>D. Moore and G. McCabe, Introduction to the Practice \n\t\tof Statistics, Third Edition, Section 6.4.<\/ul>\n<\/ul>\n<p><?php include \"stat\/footer.htm\"; ?><\/p>\n<p>&nbsp; <!--webbot bot=\"PurpleText\" PREVIEW=\"Don't change anything below this line.\"\n--> \n<\/body>\n<\/html><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Examples Example 1. A company markets an eight week long weight loss program and claims that at the end of the program on average a participant will have lost 5&#8230;<br><a class=\"moretag\" href=\"https:\/\/stats.oarc.ucla.edu\/r\/dae\/power-analysis-for-paired-sample-t-test\/\"> Read More<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":916,"menu_order":15,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"class_list":["post-933","page","type-page","status-publish","entry"],"_links":{"self":[{"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/pages\/933","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/comments?post=933"}],"version-history":[{"count":3,"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/pages\/933\/revisions"}],"predecessor-version":[{"id":24085,"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/pages\/933\/revisions\/24085"}],"up":[{"embeddable":true,"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/pages\/916"}],"wp:attachment":[{"href":"https:\/\/stats.oarc.ucla.edu\/wp-json\/wp\/v2\/media?parent=933"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}